import React from 'react';
import { Metadata, ResolvingMetadata } from 'next';
import { getDictionary } from '@/get-dictionary';
import { Locale } from '@/i18n-config';

type Props = {
    params: { id: string; lang: Locale };
    searchParams: { [key: string]: string | string[] | undefined };
};

export async function generateMetadata(
    { params: { lang } }: Props,
    parent?: ResolvingMetadata
): Promise<Metadata> {
    const dict = await getDictionary(lang);
    const seoTitle = dict.privacyPageTitle;
    const seoDescription = '';

    return {
        title: seoTitle,
        description: seoDescription,
        openGraph: {
            title: seoTitle,
            description: seoDescription,
        },
        alternates: {
            canonical: '',
        },
    };
}

export default function Privacy() {
    return (
        <div className="my-12 flex flex-col items-center justify-center gap-6 px-8 md:px-48">
            <div className="w-full space-y-3">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    طلانو چطور کار میکند؟
                </h2>
                <p className="text-lg font-normal">
                    سامانه طلانو امکان خرید و فروش طلای آب شده 18 عیار رو برای
                    کاربران خود فراهم میکنه. با طلانو میتونید با حداقل سرمایه
                    100 هزار تومان پس انداز طلایی برای خودتون بسازید. طلانو خرید
                    طلا رو بدون اجرت و با حداقل کارمزد براتون انجام میده
                </p>
                <p className="text-center text-lg font-semibold">
                    استفاده از خدمات طلانو به معنی خواندن ، فهمیدن و پذیرش کلیه
                    قوانین و مقررات طلانو است. رعایت این قوانین برای فعالیت در
                    طلانو الزامی است و استفاده از سایت به منزله پذیرش مفاد این
                    توافقنامه است.
                </p>
            </div>
            <div className="space-y-3">
                <h1 className="text-3xl font-semibold text-neutral-800">
                    قوانین و مقررات طلانو
                </h1>
                <p className="text-justify text-lg font-normal">
                    کاربر گرامی، قوانین و مقررات پیش رو، به منزله قرارداد بین
                    شما و شرکت طلانو؛ و تایید آن توسط شما و استفاده از خدمات
                    سامانه طلانو، به معنای امضای این قرارداد است. بنابراین
                    خواهشمندیم پیش از هرگونه استفاده از سامانه، این سند را به
                    طور کامل و به دقت مطالعه فرمایید. تعامل در طلانو، منوط به
                    موافقت با قوانین و مقرراتی است که در زیر خدمت شما به تفصیل
                    ارائه شده است.
                </p>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    تعاریف اولیه
                </h2>
                <ol className="list-decimal text-justify text-lg leading-relaxed">
                    <li>
                        <strong>سوت: </strong> برگرفته از عبارت «سوت طلا» و
                        نشان‌دهنده تعهد شرکت به تحویل یک سوت (یک هزارم گرم) طلای
                        ۱۸ عیار (عیار ۷۵۰) یا معادل آن با عیار دیگر به دارنده هر
                        سوت است. معادل‌سازی طلای تحویلی به کاربر با استفاده از
                        فرمول زیر انجام می‌شود:
                        <br />
                        <div className="my-2 rounded-md bg-neutral-100 px-2 py-2 text-center font-bold md:px-1">
                            وزن طلای تحویلی به گرم = ۷۵۰/۱۰۰۰ / تعداد سوت * عیار
                            تحویلی
                        </div>
                        <strong>مثال: </strong>
                        سامانه با رعایت رویه ذکر شده در بخش قوانین تحویل طلا، به
                        دارنده هر10.000 سوت ،10 گرم طلای ۱۸ عیار تحویل می‌دهد.
                    </li>
                    <li>
                        <strong>سامانه طلانو: </strong>: بستر نرم‌افزاری خرید و
                        فروش و تبادل سوت بر اساس شرایط و ضوابط مندرج در این
                        موافقتنامه است.
                    </li>
                    <li>
                        <strong>سامانه: </strong>
                        در این موافقت‌نامه حسب مورد به سامانه طلانو یا سایر
                        سامانه‌های متعلق به شرکت که خدمات موضوع موافقت‌نامه حاضر
                        بر بستر آن‌ها ارائه می‌شوند اطلاق می‌شود.
                    </li>
                    <li>
                        <strong>کاربر: </strong>
                        شخصی حقیقی یا حقوقی که با افتتاح حساب کاربری در سامانه و
                        پذیرش این موافقتنامه به سامانه متصل می‌شود و از خدمات آن
                        استفاده می‌کند.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    قوانین و تعهدات تغییرناپذیر سامانه طلانو
                </h2>
                <p className="text-lg ">
                    قوانین زیر، تعهدات اساسی شرکت به کاربران طلانو است و شرکت
                    امکان تغییر این تعهدات را از خود سلب می‌کند:
                </p>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li>
                        همواره معادل مجموع موجودی سوت کاربران سامانه، طلا به
                        صورت فیزیکی در خزانه طلانو نگهداری می‎شود. از لحظه خرید
                        کاربران تا زمان تحویل طلای معادل سوت خریداری شده،
                        مسئولیت حفظ و نگهداری این میزان طلا، بر عهده سامانه است.
                    </li>
                    <li>
                        شرکت همواره متعهد است پس از درخواست کاربر مبنی بر دریافت
                        طلای معادل موجودی سوت ، طلای معادل را به کاربر تحویل
                        دهد. محدودیت‎های عملیاتی (مانند تعطیلات رسمی یا ساعت
                        کاری) ممکن است در تحویل طلا تاخیر ایجاد کند.
                    </li>
                    <li>
                        سامانه ملزم است در صورت ثبت درخواست برداشت وجه، پس از
                        استعلام حساب بانکی، وجه را حداکثر ظرف ۳ روز کاری به حساب
                        کاربر به صورت ساتنا و پایا منتقل نماید.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    حقوق و تعهدات سامانه
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li>
                        سامانه متعهد است همواره معادل سوت فروخته شده به کاربران،
                        طلا در مالکیت خود داشته باشد و از لحظه خرید کاربران تا
                        زمان تحویل طلای خریداری شده، مسئولیت حفظ و نگهداری این
                        میزان طلا، بر عهده سامانه است.
                    </li>
                    <li>
                        با توجه به قوانین و مقررات جاری کشور و شرایط مختلف،
                        سامانه می‌تواند برای خرید و فروش طلا توسط کاربران،
                        محدودیت‌هایی از قبیل سقف خرید و فروش و… تعیین کند.
                    </li>
                    <li>
                        هم‌زمان با انجام هرگونه عملیات اعم از خرید، فروش، برداشت
                        از حساب، معامله، انتقال یا ثبت درخواست تحویل طلا، تمامی
                        کارمزدهای سامانه دریافت می‌گردد.
                    </li>
                    <li>
                        {' '}
                        در صورت درخواست کاربر برای دریافت وجه، انتقال وجه تنها
                        به شماره حساب/شبا/کارت بانکی متعلق به کاربر انجام
                        می‌شود.
                    </li>
                    <li>
                        اگر اشتباهاً یا من غیر حق یا به جهت تداخل و مشکلات
                        سیستمی، اعتبار و یا دارایی‌ای در کیف پول کاربر منظور
                        (افزوده یا کاسته) گردد، سامانه می‌تواند بدون نیاز به
                        اقدام قانونی یا قضایی نسبت به تصحیح اشتباه و بازگرداندن
                        وضعیت به حالت صحیح اقدام نماید. اقدامات سامانه در راستای
                        اصلاح اشتباهات مورد تایید کاربر بوده و از این جهت کاربر
                        مسئولیت و ادعایی را متوجه سامانه نخواهد کرد.
                    </li>
                    <li>
                        در صورتی ‌که به‌ موجب دستور مقام قضائی و یا مرجع انتظامی
                        فعالیت‌های کاربر غیرقانونی اعلام گردد و یا دستور توقیف
                        وصول شود، حساب کاربری و حساب‎های طلانو مرتبط با آن،
                        تعلیق و هرگونه فعالیت کاربری و موجودی حساب طلانو و کیف
                        پول کاربر تا تعیین تکلیف نهایی، مسدود می‌گردد.
                    </li>
                    <li>
                        سامانه طلانو یک سامانه آنلاین است که دستورات و سفارش‌های
                        کاربران را به نام و حساب آنان انجام می‌دهد و هیچ‌گونه
                        عملیاتی را خارج از حدود اختیار و دستورات کاربران انجام
                        نمی‌دهد. کاربران اعلام و اذعان می‌کنند رابطه سامانه با
                        ایشان مشمول قوانین کار و تأمین اجتماعی یا سایر قوانین و
                        مقررات مرتبط با آن نیست.
                    </li>
                    <li>
                        با توجه به نوسانات احتمالی قیمت، خرید تنها پس از پرداخت،
                        نهایی می‌شود و ثبت درخواست خرید طلا ، تا پیش از پرداخت
                        نهایی از سوی کاربر، قطعی محسوب نمی‌گردد.
                    </li>
                    <li>
                        شرکت هیچ‌گونه تعهدی در خصوص معاملات درخواست شده در خارج
                        از سامانه، ندارد.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    کارمزد خدمات
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li>
                        سامانه در ازای هر معامله (اعم از خرید یا فروش) کارمزد
                        خدمات خود را محاسبه و از طرفین معامله دریافت می‌نماید.
                        هنگام خرید طلا ، کارمزد سامانه به مبلغ طلا افزوده
                        می‌گردد و هنگام فروش طلا، وجه حاصل از فروش، پس از کسر
                        کارمزد سامانه به کیف پول ریالی کاربر واریز می‌شود.
                    </li>
                    <li>
                        هنگام تحویل طلا، به ازای میزان طلای درخواستی، کارمزد
                        تحویل و همچنین بر اساس نوع طلای تحویلی به کاربر، کارمزد
                        ضرب و یا فرآوری، از کاربران دریافت خواهد شد.
                    </li>
                    <li>
                        تعرفه کارمزدهای تمامی خدمات سامانه در صفحه کارمزدها درج
                        و به‌طور مستمر به‌روزرسانی می‌شود که کاربران می‌بایست به
                        طور مستمر کارمزد تعرفه‌ها را بررسی نمایند.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    قوانین تحویل طلا
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li>
                        کاربران می‌توانند در هر زمانی، درخواست تحویل طلای خود را
                        از طریق اپلیکیشن طلانو ثبت کنند. پس از ثبت درخواست، طی
                        ۲۴ ساعت کاری از خزانه طلانو برای هماهنگی تحویل با کاربر
                        تماس گرفته می‌شود. در حال حاضر، تحویل طلا فقط به‌صورت
                        حضوری و در خزانه تحویل فیزیکی طلانو در تهران انجام
                        می‌شود.
                    </li>
                    <li>
                        حداقل طلای قابل تحویل به کاربر، 10 گرم است و فقط
                        کاربرانی امکان ثبت درخواست تحویل طلا را دارند که به
                        میزان مورد نیاز، طلا در حساب طلانو خود داشته باشند.
                    </li>
                    <li>
                        در زمان ثبت درخواست، کاربر باید هزینه ضرب، بسته‌بندی و
                        تحویل طلا را که معادل 2.5 (دو و نیم) درصد از ارزش طلا
                        است، پرداخت کند.
                    </li>
                    <li>
                        در صورت عدم مراجعه کاربر در زمان تعیین شده در درخواست
                        تحویل طلا، درخواست ابطال می‌شود و کاربر باید دوباره
                        مراحل بالا را برای تحویل طلا انجام دهد.
                    </li>
                    <li>
                        طلا فقط به شخص کاربر یا وکیل قانونی او تحویل داده
                        می‌شود. هنگام تحویل طلا، به‌همراه داشتن کارت ملی شخص
                        تحویل گیرنده الزامی است. طلای متعلق به اشخاص حقوقی، به
                        نماینده معرفی شده از سوی ایشان تحویل داده خواهد شد.
                        نماینده مذکور هنگام مراجعه برای دریافت طلا، باید علاوه
                        بر مدارک هویتی، روزنامه آخرین تغییرات شخص حقوقی و یک
                        معرفی‌نامه در سربرگ شخص حقوقی (مطابق نمونه موجود در
                        سامانه) که به امضای صاحبان امضای مجاز رسیده باشد، ارائه
                        نماید.
                    </li>
                    <li>
                        طلای تحویلی طلانو، در قالب شمش طلای 10 گرمی ارائه
                        می‌شود.
                    </li>
                    <li>
                        شمش‌های تحویلی طلانو، دارای کد استاندارد یا کد
                        اعتبارسنجی مورد تائید اتحادیه یا اداره استاندارد ایران
                        هستند.
                    </li>
                    <li>
                        مشتریان در هنگام تحویل گرفتن طلا باید بسته‌بندی را کنترل
                        و از جهت سالم بودن آن اطمینان حاصل نمایند و در صورت
                        مشاهده هرگونه ایراد در بسته بندی (مانند پارگی و…) به
                        متصدی مربوطه اطلاع دهند. کاربر با ارائه کد محرمانه تحویل
                        طلا، صحت مرسوله را تایید نموده است.
                    </li>
                    <li>
                        در صورتی که پس از تحویل دادن طلا، پلمپ آن باز شود،
                        هیچگونه مسئولیتی بر عهده سامانه و تحویل دهنده طلا نیست.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    محدوده موافقت‌نامه و مقررات حاکم بر آن
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li>
                        با توجه به این که سامانه طلانو مطالعه این مقررات را
                        لازمه استفاده از خدمات خود قرار داده، ایجاد حساب کاربری
                        شخصی یا استفاده داوطلبانه شما از هر یک از خدمات سامانه،
                        از جمله ثبت سفارش، به معنای آگاه بودن شما از مقررات راجع
                        به شرایط استفاده از خدمات و حریم خصوصی و پذیرش کامل آن
                        مقررات است.
                    </li>
                    <li>
                        سامانه هر زمان که لازم ببیند می‌تواند شرایط استفاده از
                        خدمات یا ضوابط حریم خصوصی خود را تغییر دهد. در این صورت،
                        تغییرات پیش از اجرایی شدن، از طریق به‌روزرسانی سند حاضر،
                        در همین صفحه منعکس خواهد شد.
                    </li>
                    <li>
                        بهره‌گیری از برخی از خدمات سامانه، ممکن است علاوه بر
                        مقررات حاضر، مستلزم رعایت ضوابط اختصاصی آن خدمت نیز
                        باشد، که حسب مورد به اطلاع کاربران خواهد رسید.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    حساب‌کاربری
                </h2>
                <p className="text-justify text-lg">
                    به منظور بهره‌گیری از هر یک از خدمات سامانه طلانو، کاربران
                    باید نسبت به تکمیل فرم ثبت‌نام و ایجاد حساب کاربری اقدام
                    کنند. کاربر با ثبت‌نام موافقت می‌کند که اطلاعات دقیق و
                    معتبری از خود ارائه دهد و در صورت هرگونه تغییر، به ویژه
                    تغییر شماره تلفن همراه، این اطلاعات را به‌روزرسانی کند.
                </p>
                <ul className="list-disc space-y-3 text-justify text-lg font-bold">
                    <li className="leading-relaxed">
                        با توجه به اینکه مبادلات مالی و سرمایه گذاری در اپلیکیشن
                        و سامانه طلانو انجام می شود، نیازمند ثبت نام و احراز
                        هویت در سامانه طلانو است و برای این منظور نیز نیازمند
                        ثبت اطلاعات تماس و اطلاعاتی هویتی دقیق مطابق با اطلاعات
                        ثبت شده در سازمان ثبت احوال کشور است. در طلانو اطلاعاتی
                        نظیر شماره تلفن، نام و نام خانوادگی، تاریخ تولد اخذ می
                        شود و همچنین جهت واریز وجه، شماره شبای حساب بانکی مورد
                        تایید کاربر باید در سامانه ثبت شود.
                    </li>
                    <li className="leading-relaxed">
                        تمامی اطلاعاتی که از کاربران طلانو دریافت می شود نزد
                        طلانو محفوظ است و با هیچ شخص حقیقی یا حقوقی ثالثی به
                        اشتراک گذاشته نمی شود.
                    </li>
                </ul>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        سامانه مجاز است به‌ صورت مستقیم یا با واسطه، اطلاعاتی را
                        که برای تایید هویت کاربر ضروری است، از مراجع قانونی کسب
                        کند. هم‌چنین سامانه این اختیار را دارد که در صورت لزوم
                        برای احراز اهلیت و هویت کاربر یا شناسایی دقیق‌تر وی،
                        مدارک تکمیلی مورد نیاز خویش را از کاربر مطالبه نموده و
                        ادامه خدمت‌رسانی را منوط به ارائه مدارک مورد نیاز نماید.
                        کاربران ملزم به همکاری و ارائه اطلاعات و مدارک مورد نیاز
                        با کمال حسن نیت می‌باشند.
                    </li>
                    <li className="leading-relaxed">
                        کاربر می‌بایست هنگام ثبت‌نام، نام کاربری و رمز عبور برای
                        خود تعیین کند. با انتخاب نام کاربری و رمز عبور و تایید
                        آن توسط سامانه، کاربر به عضویت در سامانه طلانو درآمده و
                        مسئولیت تمامی امور انجام‌شده توسط وی در سامانه طلانو، به
                        عهده کاربر خواهد بود. هرگونه دسترسی یا استفاده به جز این
                        روش، به معنای تجاوز به حقوق سامانه بوده و پیگرد قانونی
                        دارد.
                    </li>
                    <li className="leading-relaxed">
                        هر کاربری مسئول حساب کاربری خود و حفظ نام کاربری و رمز
                        عبور خود است و شخصاً مسئولیت هرگونه فعالیت تحت نام
                        کاربری خود را برعهده دارد. هر گونه ادعا از سوی کاربر
                        مبنی بر انجام معامله و ثبت درخواست در حساب کاربری ایشان
                        توسط اشخاص ثالث، مسموع نیست.
                    </li>
                    <li className="leading-relaxed">
                        هر شخص صرفاً با اطلاعات هویتی و اطلاعات تماس متعلق به
                        شخص خودش می‌تواند در سامانه طلانو ثبت‌نام کند. مسئولیت
                        وارد کردن اطلاعات اشتباه و غیر واقعی در قبال سامانه
                        طلانو، مراجع قانونی و قضایی و هر شخص ذی‌نفع (از قبیل
                        مالک حقیقی شماره تلفن ثبت‌شده) به عهده کاربر خواهد بود.
                        سامانه طلانو، در صورت مطلع شدن از مغایرت اطلاعات با
                        واقع، حق تعلیق یا لغو عضویت یا مسدود سازی حساب کاربر را
                        خواهد داشت. چنانچه به علت وجود اشتباه یا نقص در اطلاعات
                        ارائه ‌شده توسط کاربر، خللی در ارائه خدمات سامانه به
                        کاربران ایجاد شود، سامانه هیچ‌گونه مسئولیتی ندارد و
                        کاربر مسئول جبران خسارات احتمالی وارده به سامانه، سایر
                        کاربران سامانه و اشخاص ثالث است.
                    </li>
                    <li className="leading-relaxed">
                        سامانه می‌تواند سطح خدمات قابل ارائه به هر کاربر را
                        متناسب با عواملی مانند سطح احراز هویت و حجم معاملات
                        کاربر، شخصی‌سازی نماید.
                    </li>
                    <li className="leading-relaxed">
                        استفاده از برخی از خدمات سامانه مستلزم احراز هویت
                        غیرحضوری کاربر خواهد بود. در این موارد، لینک احراز هویت
                        در زمان ارائه درخواست خدمت در اختیار کاربر قرار خواهد
                        گرفت. هم‌چنین برای استفاده از برخی از خدمات سامانه،
                        کاربر باید یک حساب بانکی به نام خود در یکی از بانک‌های
                        جمهوری اسلامی ایران یا بانک معرفی شده از سوی سامانه،
                        معرفی کند.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    حقوق و تعهدات کاربر
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        پس از ثبت نهایی خرید یا فروش، پردازش آن در سامانه و
                        پرداخت وجه آن (یا کسر شدن موجودی از کیف پول ریالی یا
                        حساب طلانو کاربر)، کاربر امکان لغو یا ویرایش سفارش را
                        ندارد. کاربران هرگونه حق فسخ معاملات را از خود سلب و
                        ساقط می‌کنند.
                    </li>
                    <li className="leading-relaxed">
                        در صورت فوت کاربر، وراث قانونی وی یا وکلای قانونی ایشان
                        می توانند متفقا با ارائه مستندات قانونی (از جمله گواهی
                        انحصار وراثت و اسناد هویتی خود) نسبت به ثبت درخواست
                        برداشت موجودی حساب طلانو یا تحویل گرفتن طلا و یا دریافت
                        موجودی کیف پول ریالی کاربر متوفی، اقدام کنند.
                    </li>
                    <li className="leading-relaxed">
                        کاربر متعهد است هیچگاه از خدمات سامانه به صورتی که به
                        سامانه یا به سایر کاربران آن صدمه‌ای وارد کند، استفاده
                        نکند. در صورت سوء استفاده کاربر از امکانات سامانه به
                        نحوی که خارج از حدود انتفاع مقرر بوده یا موجب آسیب مادی
                        یا معنوی به منافع سامانه یا اشخاص ثالث گردد، سامانه حق
                        قطع خدمات و محدود یا مسدود سازی دسترسی و نیز حق مراجعه
                        به مراجع ذیصلاح و اقدام نسبت به پیگیری قانونی از جمله
                        مطالبه خسارات وارده را خواهد داشت.
                    </li>
                    <li className="leading-relaxed">
                        کاربر اذعان و اقرار می‌نماید که علامت تجاری « طلانو »،
                        نام دامنه، طراحی‌های سایت، سایر طرح‌ها و حقوق مالکیت
                        فکری مندرج در سایت متعلق به سامانه بوده و حق هرگونه ادعا
                        در این خصوص یا بهره‌برداری غیرمجاز را از خود سلب
                        می‌نماید.
                    </li>
                    <li className="leading-relaxed">
                        کاربر می‌پذیرد که سامانه از پیامک و ارسال اطلاعیه در
                        برنامه کاربردی (push notification) به عنوان راه ارتباطی
                        با کاربران جهت ارسال مطالب و موضوعات مرتبط استفاده خواهد
                        کرد. کاربر ضمن اعلام رضایت خود از این موضوع، متعهد به چک
                        کردن منظم راه‌های ارتباطی جهت دریافت فوری اطلاعیه‌ها است
                        و به محض ارسال اطلاعیه از هر یک از راه‌های یادشده،
                        محتوای آن اطلاعیه ابلاغ‌شده تلقی خواهد شد.
                    </li>
                    <li className="leading-relaxed">
                        مسئولیت هرگونه خسارت احتمالی ناشی از عدم توجه کاربر به
                        ضوابط مشروح در این موافقت‌نامه، با کاربر خواهد بود.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    امنیت و محرمانگی
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم
                        اخلاقی و حرفه‌ای سامانه طلانو به شمار می‌رود. سامانه با
                        اتخاذ تدابیر امنیتی متعارف، امنیت پایه زیرساخت‌ها و
                        خدمات خود را تأمین می‌کند و با بهره‌گیری از روش‌های
                        مطلوب مدیریت داده، در حد متعارف از افشای اطلاعات کاربران
                        جلوگیری می‌کند. با این حال سامانه نسبت به اموری که به
                        طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری
                        امنیت حساب کاربری اوست، یا اموری که کنترل آن بنا به
                        معیارهای متعارف از حیطه کنترل سامانه خارج است، مسئولیتی
                        نخواهد داشت.
                    </li>
                    <li className="space-y-3 leading-relaxed">
                        سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت:
                        <br />
                        <ol className="list-decimal space-y-3 pr-8 text-lg">
                            <li>
                                ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای
                                ارتباط با سامانه
                            </li>
                            <li>
                                استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا
                                نسخه‌های غیر معتبر برنامه کاربردی (اپلیکیشن)
                                سامانه طلانو
                            </li>
                            <li>
                                در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص
                                ثالث
                            </li>
                        </ol>
                    </li>
                    <li className="leading-relaxed">
                        سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران
                        را درخواست یا این اطلاعات را جمع‌آوری و پردازش می‌کند که
                        برای ارائه خدمات یا ارائه بهتر خدمات به ایشان، ضروری
                        باشد. واگذاری اطلاعات از سوی کاربر به این معناست که حسب
                        مورد اجازه پردازش یا ذخیره‌سازی آن‌ها را نیز به سامانه
                        داده است و سامانه می‌تواند با گمنام سازی این اطلاعات، از
                        آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
                        آماری، تهیه بروشور و غیره استفاده کند.
                    </li>
                    <li className="leading-relaxed">
                        کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه،
                        ارائه نسخه ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر
                        یا اخلال در سامانه، اجرای نرم‌افزار یا اسکریپتی جهت
                        ایندکس‌گذاری، مطالعه یا هرگونه داده‌کاوی بر روی سامانه،
                        یا دسترسی غیر متداول و غیر قانونی به هر یک از قسمت‌های
                        آن را ندارند و هر اقدامی جهت هر یک از این موارد تخلف
                        محسوب شده و ناقض حقوق سامانه طلانو خواهد بود. در چنین
                        مواردی سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب
                        مورد حساب کاربری کاربر متخلف را به صورت موقت یا دائم
                        محدود، مسدود یا معلق کند.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    تعلیق و قطع دسترسی
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        هر گونه فعالیت ناقض قوانین جمهوری اسلامی ایران از قبیل
                        قوانین مالی و اقتصادی، مصوبات بانک مرکزی و شورای پول و
                        اعتبار، قوانین ناظر بر فعالیت‌های رایانه‌ای، ارتکاب هر
                        یک از جرائم مندرج در قوانین کشوری و نیز نقض حقوق سامانه
                        و نقض تعهدات مندرج در این موافقت‌نامه، این اختیار را به
                        سامانه می‌دهد که معاملات انجام شده توسط کاربر را ابطال
                        کند و صرفا اصل وجه دریافت شده (و نه قیمت روز طلا) را به
                        کیف پول ریالی کاربر برگرداند. به علاوه سامانه طلانو
                        می‌تواند، دسترسی کاربر را به صورت دائم یا موقت قطع کند.
                    </li>
                    <li className="leading-relaxed">
                        در هر مورد که سامانه متوجه فعالیت مشکوک یا غیرقانونی یا
                        نقض شروط و مقررات سامانه توسط یک کاربر شود، حق خواهد
                        داشت تا انجام تحقیقات بیشتر، دسترسی آن کاربر را به طور
                        موقت معلق کند. تعلیق دسترسی رافع مسئولیت کاربر نسبت به
                        اجرای تعهداتی که پیش از تعلیق ایجاد شده، نخواهد بود و
                        حقوق کاربر به موجب این موافقت‌نامه را نیز، به خودی خود
                        منتفی نخواهد کرد.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    قانون حاکم و شیوه حل و فصل اختلاف
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        اگر اختلافی میان کاربر با سامانه طلانو به وجود آید،
                        سامانه تلاش خواهد کرد تا این اختلاف را به روش منصفانه،
                        کم ‌هزینه و بدون نیاز به مراجع قانونی حل کند. از همین رو
                        واحد پشتیبانی سامانه آماده دریافت و رسیدگی به مشکلات
                        کاربران است.
                    </li>
                    <li className="leading-relaxed">
                        هرگونه اختلاف میان کاربر با سایر کاربران سامانه، صرفاً
                        توسط داور مرضی الطرفینی که توسط سامانه طلانو معرفی
                        می‌گردد، حل و فصل خواهد شد. رای داور قطعی و غیرقابل
                        اعتراض است و سامانه بر اساس این رأی نسبت به انجام اقدام
                        لازم، مبادرت نموده و کاربران نیز رای داور مذکور را
                        کاملاً پذیرفته و به سامانه این اختیار را می‌دهند بدون
                        تشریفات قضائی نسبت به اجرای رای داور اقدام نماید.
                    </li>
                    <li className="leading-relaxed">
                        خواهان داوری باید ابتدا هزینه داوری را بپردازد و در صورت
                        ذی حق شناخته شدن، هزینه داوری از طرف مقابل قابل مطالبه
                        است.
                    </li>
                    <li className="leading-relaxed">
                        قانون حاکم بر این موافقت‌نامه، قوانین و مقررات شکلی و
                        ماهوی کشور جمهوری اسلامی ایران است و تمامی اختلافات به
                        وجود آمده مطابق این قوانین حل و فصل خواهند شد.
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    حد مسئولیت سامانه طلانو
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        سامانه در هر حال مسئول حفظ و تحویل دارایی خریداری شده
                        توسط کاربران، مطابق شروط و مقررات سایت است؛ ولی هیچ‌گونه
                        مسئولیتی در خصوص زیان‌ها و خسارت‌های احتمالی ناشی از
                        معاملات کاربران، نوسانات ناشی از تغییر قیمت‌ها یا عدم
                        ثبت سفارش کاربر نخواهد داشت.
                    </li>
                    <li className="leading-relaxed">
                        در صورتی که مبلغ از حساب کاربر کسر شده باشد ولی سفارش
                        کاربر ثبت نشده باشد، سامانه تنها مسئول استرداد اصل مبلغ
                        دریافت شده (و نه قیمت روز سوت یا معادل طلایی که کاربر
                        قصد خرید آن را داشته) است.
                    </li>
                    <li className="leading-relaxed">
                        سامانه مسئول خسارات اتفاقی، غیرقابل ‌پیش‌بینی، تبعی و
                        عدم‌النفع در قبال کاربران نیست. مسئولیت سامانه محدود به
                        خسارات مستقیم و بلاواسطه‌ای است که با اثبات تقصیر سامانه
                        به کاربران یا اشخاص ثالث وارد شده است. در صورتی ‌که ثابت
                        شود ورود خسارت در نتیجه اهمال، تقصیر و یا نقض تعهدات
                        قانونی یا قراردادی کاربران بوده است، سامانه تعهدی به
                        پرداخت خسارت نخواهد داشت.
                    </li>
                    <li className="leading-relaxed">
                        در صورت ناموفق شدن تراکنش و بازگشت وجه به کارت بانکی
                        کاربر، سامانه مسئولیتی در قبال تغییر قیمت محصولات ندارد.
                    </li>
                    <li className="leading-relaxed">
                        سامانه مسئولیتی در مورد خساراتی که به ادعای کاربر در اثر
                        قطع دسترسی یا تعلیق ارائه خدمات به او به دستور مرجع
                        قضایی یا مرجع صالح دولتی وارد شده، نخواهد داشت. در صورت
                        محرمانه نبودن دستور یا حکم مذکور، مراتب به کاربر
                        اطلاع‌رسانی خواهد شد.
                    </li>
                    <li className="leading-relaxed">
                        از جمله رویدادهای ناگهانی، که ممکن است عملکرد سامانه‌های
                        طلانو را تحت تاثیر قرار دهد، می‌توان به حملات سایبری
                        سازمان ‌یافته، ویروس‌ها، تروجان‌ها، کرم‌ها و هرگونه
                        آلودگی سیستم‌های کاربران و یا آلودگی‌های که تاکنون وجود
                        نداشته و یا ناشناخته بوده، دستورات قضائی و فیلترینگ،
                        هرگونه اخلال در شبکه اینترنت داخلی و بین‌المللی، مسدودی
                        حساب‌های بانکی، قطعی برق گسترده، سیل، زلزله، شیوع
                        بیماری‌ها و هرگونه رخداد طبیعی و انسانی و غیره در سطح
                        کشور و یا بین‌المللی که منجر به اخلال در فعالیت سامانه
                        خارج اراده وی گردد، اشاره کرد. این موارد تابع احکام
                        قانونی مربوط به فورس ماژور بوده و تا رفع این شرایط ممکن
                        است خدمات سامانه بدون هرگونه مسئولیت قانونی، متوقف
                        می‌گردد.
                    </li>
                    <li className="leading-relaxed">
                        در صورت توقف فعالیت سامانه، به دستور مقام‌های اداری،
                        قانونی و قضائی و یا مشکلات فنی سیستم پرداخت کشور، تا رفع
                        این انسداد، سامانه مسئولیتی در قبال کاربران اعم از
                        پرداخت خسارت و… ندارد
                    </li>
                </ol>
            </div>
            <div className="space-y-3">
                <h2 className="text-3xl font-semibold text-neutral-800">
                    پشتیبانی
                </h2>
                <ol className="list-decimal space-y-3 text-justify text-lg">
                    <li className="leading-relaxed">
                        ارائه خدمات در سامانه طلانو و امکان انجام معاملات، به
                        صورت آنلاین و در طول زمان تعیین شده در سایت طلانو امکان
                        پذیر است.
                    </li>
                    <li className="leading-relaxed">
                        کاربران می‌توانند برای اعلام هر نوع اشکال، یا درج سوال و
                        همچنین ارائه پیشنهادات خود از طریق شیوه‌های ارتباطی
                        موجود و یا ارسال ایمیل با پشتیبانی سامانه ارتباط برقرار
                        نمایند تا در اسرع وقت نسبت به پاسخگویی توسط اپراتورهای
                        سامانه اقدام گردد.
                    </li>
                </ol>
            </div>
            <div className="w-full">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    سیاست ‌های حریم خصوصی طلانو
                </h2>
                <p className="text-lg font-normal">
                    طلانو به حریم خصوصی شما احترام می‌گذارد و متعهد به حفاظت از
                    داده‌های شخصی شماست. در این راستا قوانین و مقررات زیر در
                    طلانو رعایت می‌گردد:
                </p>
                <ol className="mt-6 list-decimal text-lg font-normal leading-8">
                    <li>
                        طلانو تنها اطلاعات شخصی شما شامل داده‌های هویتی اعم از
                        نام، نام خانوادگی، نام کاربری یا هر نوع شناسه مشابه،
                        تاریخ تولد و جنسیت و داده‌های تماس اعم از آدرس، آدرس
                        ایمیل و شماره تلفن و داده‌های فنی شما آدرس IP، موقعیت
                        جغرافیایی، سیستم عامل و اطلاعات سایر فناوری‌هایی که از
                        آن‌ها برای اتصال به سایت استفاده می‌کنید را ممکن است
                        جمع‌آوری کند. اما هیچ یک از گروه‌های خاص داده‌های شخصی
                        در مورد شما را شامل جزئیات مربوط به نژاد یا قومیت، عقاید
                        مذهبی یا فلسفی، زندگی جنسی، جهت‌گیری جنسی، نظرات سیاسی
                        را جمع‌آوری نخواهد کرد.
                    </li>
                    <li>
                        طلانو از داده‌های شخصی شما فقط برای اهدافی که از ابتدا
                        جمع‌آوری برای آن صورت گرفته است استفاده خواهد کرد؛ مگر
                        آنکه لزوم استفاده معقول آن برای هدفی دیگر را در نظر
                        بگیریم و آن هدف با هدف اولیه سازگار باشد.
                    </li>
                    <li>
                        طلانو ممکن است از روش‌های مختلف داده‌های تبلیغاتی را
                        برای شما ارسال نماید. شما می‌توانید در هر زمانی از طریق
                        لینک انصراف که ذیل پیام‌های تبلیغاتی ارسالی به شما درج
                        شده یا از طریق تماس با ما، از ما یا اشخاص ثالث بخواهید
                        که ارسال پیام‌های تبلیغاتی را متوقف کنند.
                    </li>
                    <li>
                        طلانو می‎تواند داده‌های مرتبط با شما را در اختیار اشخاص
                        ثالث داخلی و خارجی قرار دهد. اما در هر صورت، همه اشخاص
                        ثالث را ملزم می‌کنیم که امنیت داده‌های شخصی شما را حفظ
                        کنند و از این داده‌ها مطابق با قانون استفاده نمایند.
                    </li>
                </ol>
            </div>
            <div className="w-full">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    کاربر طلانو موارد زیر را می‌پذیرد:
                </h2>
                <ul className="mt-8 flex list-disc flex-col gap-7 marker:text-3xl marker:text-neutral-300">
                    <li>
                        <h2 className="text-2xl font-semibold text-neutral-800">
                            سلب مسئولیت :{' '}
                        </h2>
                        <p>
                            ۱. هر محتوا و مطالب مندرج در سایت و کانال‌های رسمی
                            ارتباطی طلانو، جمع‌بندی نظرات و تحلیل‌های شخصی و غیر
                            تعهد آور بوده و هیچگونه توصیه‌ای مبنی بر خرید، فروش،
                            ورود و یا خروج از بازار بورس و ارز دیجیتال نمی باشد.
                            همچنین کلیه اخبار و تحلیل‌های مندرج در سایت و
                            کانال‌ها، صرفا بازنشر اطلاعات از منابع رسمی و غیر
                            رسمی داخلی و خارجی است و بدیهی است استفاده کنندگان
                            محتوای مذکور، مسئول پیگیری و حصول اطمینان از اصالت و
                            درستی مطالب هستند. از این رو ضمن سلب مسئولیت اعلام
                            می‌دارد مسئولیت هرنوع تصمیم گیری و اقدام و سود و
                            زیان احتمالی در بازار سرمایه و ارز دیجیتال، با شخص
                            معامله گر است. ۲. طلانو هیچ گونه فعالیتی در زمینه
                            سیگنال دهی یا تبلیغ سهام و شرکتهای مختلف انجام
                            نمیدهد و تنها سیگنال‌های ارائه شده در شبکه های
                            اجتماعی را جمع‌بندی، منتشر و ارزیابی می‌کند.
                        </p>
                    </li>
                    <li>
                        سایت طلانو اجازه ارسال پیامک به کاربران برای اطلاع‌رسانی
                        خدمات و سرویس‌های مختلف مانند دیده‌بان، اخبار بازار،
                        نظرسنجی، کمپین‌های اختصاصی و کد ورود را دارد.
                    </li>
                    <li>
                        تلاش طلانو ارائه‌ی خدمات به صورت ۲۴ ساعته در طول شبانه
                        روز خواهد بود. لیکن در صورت وقوع حوادث مختلف، یا وقوع
                        خطا در خدمات، مشکل را مرتفع نموده و ارائه‌ی خدمات را از
                        سر خواهد گرفت. در این موارد امکان تمدید اشتراک برای
                        کاربران وجود خواهد داشت اما سود و زیان ناشی از این وقفه
                        زمانی را بر عهده طلانو نخواهد بود.
                    </li>
                    <li>
                        در صورت وقوع خسارت به سایت، در اثر فعالیت‌های غیر قانونی
                        کاربر، سایت طلانو می‌تواند طبق قانون نسبت به مطالبه‌ی آن
                        اقدام کند. لذا باید با رعایت قوانین و مقررات از خدمات
                        سایت استفاده کنید.
                    </li>
                    <li>
                        کاربران موظف هستند هنگام ثبت نام، شماره تماس و آدرس پست
                        الکترونیک معتبر اعلام نمایند تا برای اطلاع‌رسانی های
                        سایت با مشکل مواجه نشوند و در صورت عدم اعلام اطلاعات
                        صحیح طلانو امکان تعلیق فعالیت کاربر را خواهد داشت.
                    </li>
                    <li>
                        امکان تغییر شماره تماس ثبت شده هنگام ثبت نام، برای
                        کاربران وجود ندارد.
                    </li>
                    <li>
                        هر شماره تماس و آدرس پست الکترونیک، تنها یک مرتبه امکان
                        ثبت نام در طلانو را دارد.
                    </li>
                    <li>
                        کاربران در صورت تمایل به استفاده از تصویر پروفایل، موظف
                        هستند تا از تصاویر متعارف استفاده کنند. در غیر این صورت
                        تصویر از پروفایل کاربر حذف خواهد شد.
                    </li>
                    <li>
                        کاربران موظف هستند در بخش نظرات سایت طلانو از انجام
                        تبلیغات، ثبت نظرات توهین آمیز و خلاف موازین جمهوری
                        اسلامی، افترا، نظرات سیاسی غیر متعارف، توهینهای قومیتی و
                        مذهبی، بیان اخبار و تحلیلهای کذب برای ایجاد جو در بازار
                        و هر گونه اقدامی که مصداق محتوای مجرمانه شناخته میشود،
                        خودداری کنند.
                    </li>
                    <li>
                        طلانو این حق را دارد که نظرات ارسال شده در سایت را
                        متناسب با قوانین سایت و نظر خود، حذف یا ویرایش کند.
                    </li>
                    <li>
                        کلیه حقوق مادی و معنوی سایت، انحصارا متعلق به طلانو است.
                        هرگونه تقلید، کپی برداری و یا استفاده از تمام یا بخشی از
                        عنوان و طراحی سایت، لوگو، محتوا و هر گونه سوء استفاده از
                        نام و محتوای منتشر شده توسط طلانو، غیر قانونی است.
                    </li>
                    <li>
                        اختیار هرگونه طراحی مجدد، ادغام یا توقف ارائه خدمات در
                        هر زمان و به هر علتی برای مجموعه طلانو محفوظ است.
                        بنابراین مسئولیتی بابت زیان احتمالی کاربران، متوجه طلانو
                        نمی‌شود.
                    </li>
                    <li>
                        هرگونه اخلال در زیرساخت شبکه اینترنت یا زیرساخت های
                        ارتباطی مانند انواع پروتکل های ارتباطی یا سامانه پیامک
                        که باعث ایجاد مشکل در سایت طلانو، دسترسی ها و رابط
                        کاربری سایت و خدمات رسانی به کاربران سایت می شود از عهده
                        طلانو خارج است.
                    </li>
                    <li>
                        طلانو در هر زمانی میتواند با اطلاع‌رسانی به کاربران نسبت
                        به تغییر تمامی بند های قوانین و مقررات را متناسب با نظر
                        خود اقدام کند.
                    </li>
                    <li>
                        قوه قهریه: تمامی شرایط و قوانین مندرج، در شرایط عادی
                        قابل اجرا است و در صورت بروز هرگونه از موارد قوه قهریه،
                        مجموعه طلانو هیچ گونه مسئولیتی ندارد.
                    </li>
                    <li>
                        اگر هر سوالی در مورد این توافق‌نامه دارید و یا می‌خواهید
                        به هر دلیلی با شرکت تماس داشته باشید لطفاً با قسمت
                        پشتیبانی شرکت در تماس باشید.
                    </li>
                </ul>
            </div>
        </div>
    );
}
