import React from 'react';
import { Metadata, ResolvingMetadata } from 'next';
import { getDictionary } from '@/get-dictionary';
import { Locale } from '@/i18n-config';

type Props = {
    params: { id: string; lang: Locale };
    searchParams: { [key: string]: string | string[] | undefined };
};

export async function generateMetadata(
    { params: { lang } }: Props,
    parent?: ResolvingMetadata
): Promise<Metadata> {
    const dict = await getDictionary(lang);
    const seoTitle = dict.privacyPageTitle;
    const seoDescription = '';

    return {
        title: seoTitle,
        description: seoDescription,
        openGraph: {
            title: seoTitle,
            description: seoDescription,
        },
        alternates: {
            canonical: '',
        },
    };
}

export default function Privacy() {
    return (
        <div className="my-12 flex flex-col items-center justify-center gap-6 px-48">
            <h1 className="text-3xl font-semibold text-neutral-800">
                قوانین و مقررات طلانو
            </h1>
            <div className="w-full">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    طلانو چطور کار میکند؟
                </h2>
                <p className="text-lg font-normal">
                    طلانو اطلاعات منتشر شده در شبکه‌های مجازی را جمع‌آوری و
                    تحلیل می‌کند. با کمک طلانو می‌توانید توجه تحلیل‌گران به
                    سهم‌های مختلف را ارزیابی نمایید و به واسطه این تحلیل خرید و
                    فروش موفق‌تری را تجربه نمایید. فعالیت سایت طلانو در چارچوب
                    قوانین جمهوری اسلامی است و انجام هر گونه فعالیتی که بر اساس
                    فهرست کارگروه تعیین مصادیق محتوای مجرمانه تخلف محسوب شود،
                    ممنوع است.
                </p>
                <p className="text-center text-lg font-semibold">
                    استفاده از خدمات طلانو به معنی خواندن ، فهمیدن و پذیرش کلیه
                    قوانین و مقررات طلانو است. رعایت این قوانین برای فعالیت در
                    طلانو الزامی است و استفاده از سایت به منزله پذیرش مفاد این
                    توافقنامه است.
                </p>
            </div>
            <div className="w-full">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    سیاست ‌های حریم خصوصی طلانو
                </h2>
                <p className="text-lg font-normal">
                    طلانو به حریم خصوصی شما احترام می‌گذارد و متعهد به حفاظت از
                    داده‌های شخصی شماست. در این راستا قوانین و مقررات زیر در
                    طلانو رعایت می‌گردد:
                </p>
                <ol className="mt-6 list-decimal text-lg font-normal leading-8">
                    <li>
                        طلانو تنها اطلاعات شخصی شما شامل داده‌های هویتی اعم از
                        نام، نام خانوادگی، نام کاربری یا هر نوع شناسه مشابه،
                        تاریخ تولد و جنسیت و داده‌های تماس اعم از آدرس، آدرس
                        ایمیل و شماره تلفن و داده‌های فنی شما آدرس IP، موقعیت
                        جغرافیایی، سیستم عامل و اطلاعات سایر فناوری‌هایی که از
                        آن‌ها برای اتصال به سایت استفاده می‌کنید را ممکن است
                        جمع‌آوری کند. اما هیچ یک از گروه‌های خاص داده‌های شخصی
                        در مورد شما را شامل جزئیات مربوط به نژاد یا قومیت، عقاید
                        مذهبی یا فلسفی، زندگی جنسی، جهت‌گیری جنسی، نظرات سیاسی
                        را جمع‌آوری نخواهد کرد.
                    </li>
                    <li>
                        طلانو از داده‌های شخصی شما فقط برای اهدافی که از ابتدا
                        جمع‌آوری برای آن صورت گرفته است استفاده خواهد کرد؛ مگر
                        آنکه لزوم استفاده معقول آن برای هدفی دیگر را در نظر
                        بگیریم و آن هدف با هدف اولیه سازگار باشد.
                    </li>
                    <li>
                        طلانو ممکن است از روش‌های مختلف داده‌های تبلیغاتی را
                        برای شما ارسال نماید. شما می‌توانید در هر زمانی از طریق
                        لینک انصراف که ذیل پیام‌های تبلیغاتی ارسالی به شما درج
                        شده یا از طریق تماس با ما، از ما یا اشخاص ثالث بخواهید
                        که ارسال پیام‌های تبلیغاتی را متوقف کنند.
                    </li>
                    <li>
                        طلانو می‎تواند داده‌های مرتبط با شما را در اختیار اشخاص
                        ثالث داخلی و خارجی قرار دهد. اما در هر صورت، همه اشخاص
                        ثالث را ملزم می‌کنیم که امنیت داده‌های شخصی شما را حفظ
                        کنند و از این داده‌ها مطابق با قانون استفاده نمایند.
                    </li>
                </ol>
            </div>
            <div className="w-full">
                <h2 className="text-2xl font-semibold text-neutral-800">
                    کاربر طلانو موارد زیر را می‌پذیرد:
                </h2>
                <ul className="mt-8 flex list-disc flex-col gap-7 marker:text-3xl marker:text-neutral-300">
                    <li>
                        <h2 className="text-2xl font-semibold text-neutral-800">
                            سلب مسئولیت :{' '}
                        </h2>
                        <p>
                            ۱. هر محتوا و مطالب مندرج در سایت و کانال‌های رسمی
                            ارتباطی طلانو، جمع‌بندی نظرات و تحلیل‌های شخصی و غیر
                            تعهد آور بوده و هیچگونه توصیه‌ای مبنی بر خرید، فروش،
                            ورود و یا خروج از بازار بورس و ارز دیجیتال نمی باشد.
                            همچنین کلیه اخبار و تحلیل‌های مندرج در سایت و
                            کانال‌ها، صرفا بازنشر اطلاعات از منابع رسمی و غیر
                            رسمی داخلی و خارجی است و بدیهی است استفاده کنندگان
                            محتوای مذکور، مسئول پیگیری و حصول اطمینان از اصالت و
                            درستی مطالب هستند. از این رو ضمن سلب مسئولیت اعلام
                            می‌دارد مسئولیت هرنوع تصمیم گیری و اقدام و سود و
                            زیان احتمالی در بازار سرمایه و ارز دیجیتال، با شخص
                            معامله گر است. ۲. طلانو هیچ گونه فعالیتی در زمینه
                            سیگنال دهی یا تبلیغ سهام و شرکتهای مختلف انجام
                            نمیدهد و تنها سیگنال‌های ارائه شده در شبکه های
                            اجتماعی را جمع‌بندی، منتشر و ارزیابی می‌کند.
                        </p>
                    </li>
                    <li>
                        سایت طلانو اجازه ارسال پیامک به کاربران برای اطلاع‌رسانی
                        خدمات و سرویس‌های مختلف مانند دیده‌بان، اخبار بازار،
                        نظرسنجی، کمپین‌های اختصاصی و کد ورود را دارد.
                    </li>
                    <li>
                        تلاش طلانو ارائه‌ی خدمات به صورت ۲۴ ساعته در طول شبانه
                        روز خواهد بود. لیکن در صورت وقوع حوادث مختلف، یا وقوع
                        خطا در خدمات، مشکل را مرتفع نموده و ارائه‌ی خدمات را از
                        سر خواهد گرفت. در این موارد امکان تمدید اشتراک برای
                        کاربران وجود خواهد داشت اما سود و زیان ناشی از این وقفه
                        زمانی را بر عهده طلانو نخواهد بود.
                    </li>
                    <li>
                        در صورت وقوع خسارت به سایت، در اثر فعالیت‌های غیر قانونی
                        کاربر، سایت طلانو می‌تواند طبق قانون نسبت به مطالبه‌ی آن
                        اقدام کند. لذا باید با رعایت قوانین و مقررات از خدمات
                        سایت استفاده کنید.
                    </li>
                    <li>
                        کاربران موظف هستند هنگام ثبت نام، شماره تماس و آدرس پست
                        الکترونیک معتبر اعلام نمایند تا برای اطلاع‌رسانی های
                        سایت با مشکل مواجه نشوند و در صورت عدم اعلام اطلاعات
                        صحیح طلانو امکان تعلیق فعالیت کاربر را خواهد داشت.
                    </li>
                    <li>
                        امکان تغییر شماره تماس ثبت شده هنگام ثبت نام، برای
                        کاربران وجود ندارد.
                    </li>
                    <li>
                        هر شماره تماس و آدرس پست الکترونیک، تنها یک مرتبه امکان
                        ثبت نام در طلانو را دارد.
                    </li>
                    <li>
                        کاربران در صورت تمایل به استفاده از تصویر پروفایل، موظف
                        هستند تا از تصاویر متعارف استفاده کنند. در غیر این صورت
                        تصویر از پروفایل کاربر حذف خواهد شد.
                    </li>
                    <li>
                        کاربران موظف هستند در بخش نظرات سایت طلانو از انجام
                        تبلیغات، ثبت نظرات توهین آمیز و خلاف موازین جمهوری
                        اسلامی، افترا، نظرات سیاسی غیر متعارف، توهینهای قومیتی و
                        مذهبی، بیان اخبار و تحلیلهای کذب برای ایجاد جو در بازار
                        و هر گونه اقدامی که مصداق محتوای مجرمانه شناخته میشود،
                        خودداری کنند.
                    </li>
                    <li>
                        طلانو این حق را دارد که نظرات ارسال شده در سایت را
                        متناسب با قوانین سایت و نظر خود، حذف یا ویرایش کند.
                    </li>
                    <li>
                        کلیه حقوق مادی و معنوی سایت، انحصارا متعلق به طلانو است.
                        هرگونه تقلید، کپی برداری و یا استفاده از تمام یا بخشی از
                        عنوان و طراحی سایت، لوگو، محتوا و هر گونه سوء استفاده از
                        نام و محتوای منتشر شده توسط طلانو، غیر قانونی است.
                    </li>
                    <li>
                        اختیار هرگونه طراحی مجدد، ادغام یا توقف ارائه خدمات در
                        هر زمان و به هر علتی برای مجموعه طلانو محفوظ است.
                        بنابراین مسئولیتی بابت زیان احتمالی کاربران، متوجه طلانو
                        نمی‌شود.
                    </li>
                    <li>
                        هرگونه اخلال در زیرساخت شبکه اینترنت یا زیرساخت های
                        ارتباطی مانند انواع پروتکل های ارتباطی یا سامانه پیامک
                        که باعث ایجاد مشکل در سایت طلانو، دسترسی ها و رابط
                        کاربری سایت و خدمات رسانی به کاربران سایت می شود از عهده
                        طلانو خارج است.
                    </li>
                    <li>
                        طلانو در هر زمانی میتواند با اطلاع‌رسانی به کاربران نسبت
                        به تغییر تمامی بند های قوانین و مقررات را متناسب با نظر
                        خود اقدام کند.
                    </li>
                    <li>
                        قوه قهریه: تمامی شرایط و قوانین مندرج، در شرایط عادی
                        قابل اجرا است و در صورت بروز هرگونه از موارد قوه قهریه،
                        مجموعه طلانو هیچ گونه مسئولیتی ندارد.
                    </li>
                    <li>
                        اگر هر سوالی در مورد این توافق‌نامه دارید و یا می‌خواهید
                        به هر دلیلی با شرکت تماس داشته باشید لطفاً با قسمت
                        پشتیبانی شرکت در تماس باشید.
                    </li>
                    <li className="marker:text-white">
                        <h2 className="text-2xl font-semibold text-neutral-800">
                            خط‌ مشی رازداری افزونه طلانو:
                        </h2>
                    </li>
                    <li>
                        افزونه‌ی طلانو جهت استفاده در هر مرورگر تنها از طریق
                        فروشگاه‌های معتبر متعلق به آن مرورگر ارائه خواهند شد.
                    </li>
                    <li>
                        جمع اوری داده از مشتری: افزونه طلانو آدرس سایت هایی که
                        کاربران در مرورگر وارد می کنند را بررسی می کند و داده ی
                        دیگری از کاربر جمع آوری نمی کند.
                    </li>
                    <li>دسترسی‌های مورد نیاز افزونه به شرح زیر است:</li>
                    <ul className="mt-3 list-disc px-20 marker:text-black">
                        <li>
                            “activeTab”, “tabs”: این مجوز به ‌منظور دسترسی به
                            آدرس وب‌سایت‌ استفاده می شود تا اگر آدرس وب سایتی که
                            در لیست وب سایت های مورد پشتیبانی افزونه باشد
                            فراخوانی شود، افزونه به درستی اجرا شود و اطلاعات
                            تکمیلی را در اختیار کاربر قرار دهد.
                        </li>
                    </ul>
                </ul>
            </div>
            <div className="mt-6 flex flex-col gap-3" dir="ltr">
                <b className="text-2xl">Privacy Policy</b>
                <p className="text-lg font-normal">
                    Privacy of users is a very important and serious concern. In
                    Sahmeto, policies have been adopted so that users privacy
                    will not be endangered. We are committed to preserve and
                    respect your privacy.
                </p>
                <b className="text-2xl">Customer Data Collection:</b>
                <p className="text-lg font-normal">
                    The browser extension checks the URLs of sites that users
                    enter in the browser and does not collect any other data
                    from the user.
                </p>
                <b className="text-2xl">
                    The permissions required by the extension are as follows:
                </b>
                <p className="text-lg font-normal">
                    ”activeTab”, “tabs”: This permission is used to get the web
                    page URL on supported websites for running extension
                    correctly.
                </p>
            </div>
        </div>
    );
}
