import { isMobile } from 'react-device-detect';
import { ProductsNavigator } from '@/components/products-navigator';
import { Disclaimer } from '@/components/disclaimer';
import React from 'react';
import { getDictionary } from '@/get-dictionary';
import { Metadata } from 'next';
import {
    Accordion,
    AccordionContent,
    AccordionItem,
    AccordionTrigger,
} from '@/components/ui/accordion';
import { ChevronDown } from 'lucide-react';

export const metadata: Metadata = {
    title: 'سوالات متداول | سهمتو',
    description: '',
};

const FAQs = [
    {
        id: 13,
        category: 'عمومی',
        title: '1-\tسهم تو چه کاری انجام می‌دهد؟',
        question: 'سهم تو چه کاری انجام می‌دهد؟',
        answer: 'سهم تو، سیگنال‌های خرید و فروشی که هر تحلیلگر بازار سرمایه در شبکه اجتماعی ارائه می‌دهد را جمع‌آوری و به کمک هوش مصنوعی، سیگنال‌ها و کانال‌های تلگرامی اعتبارسنجی می‌کند.',
        priority: 1,
        updated: '2020-12-07T11:08:56.040700+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 12,
        category: 'عمومی',
        title: '2-\tسهم تو چه اطلاعاتی را در مورد سهم‌های بورسی در اختیار شما می‌گذارد؟',
        question:
            'سهم تو چه اطلاعاتی را در مورد سهم‌های بورسی در اختیار شما می‌گذارد؟',
        answer: 'سهم تو، تعداد کل سیگنال‌های خرید و فروش هر سهم در کانال های بورسی، کانال‌های سیگنال‌دهنده‌ی آن سهم و اطلاعات تکنیکالی و بنیادی دیگری را در اختیار مخاطبان قرار می‌دهد.',
        priority: 2,
        updated: '2020-12-07T11:09:05.324155+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 11,
        category: 'عمومی',
        title: '3-\tسهم تو چه اطلاعاتی در مورد کانال‌های بورسی می‎دهد؟',
        question: 'سهم تو چه اطلاعاتی در مورد کانال‌های بورسی می‌دهد؟',
        answer: 'سهم تو سبد پیشنهادی کانال بورسی، سیگنال‌های خرید و فروش کانال، میزان بازدهی سهم‌ها و رتبه تحلیلگر در کل کانال‌های بورسی را در اختیار شما قرار می‌دهد.',
        priority: 3,
        updated: '2020-12-07T11:09:13.423136+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 10,
        category: 'عمومی',
        title: '4-\tچطور می توانم از خدمات سهم تو استفاده کنم؟',
        question: 'چطور می توانم از خدمات سهم تو استفاده کنم؟',
        answer: 'برای استفاده از خدمات سهم تو، کافیست در سهم تو ثبت‌نام کنید و از خدمات رایگان آن استفاده کنید.',
        priority: 4,
        updated: '2020-12-07T11:09:21.380300+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 9,
        category: 'عمومی',
        title: '5-\tآیا تمام خدمات سهم تو نیاز به پرداخت هزینه دارد؟',
        question: 'آیا تمام خدمات سهم تو نیاز به پرداخت هزینه دارد؟',
        answer: 'خیر تمام خدمات سهم تو نیاز به پرداخت هزینه ندارد و با ثبت نام در سهم تو می‌توانید از برخی از خدمات رایگان سهم تو استفاده کنید.',
        priority: 5,
        updated: '2020-12-07T11:09:30.314835+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 8,
        category: 'عمومی',
        title: 'چطور می‌توانم پرداخت انجام دهم؟',
        question: 'چطور می‌توانم پرداخت انجام دهم؟',
        answer: 'برای خرید هر یک از طرح‌های سهم تو کافیست از قسمت پروفایل روی خرید طرح کلیک کنید و بعد از انتخاب طرح پیشنهادی، هزینه طرح را اینترنتی پرداخت کنید.',
        priority: 6,
        updated: '2020-12-07T11:09:37.422219+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 7,
        category: 'عمومی',
        title: '7-\tآیا هر زمان که بخواهم می‌توانم عضویت خودم را کنسل کنم؟',
        question: 'آیا هر زمان که بخواهم می‌توانم عضویت خودم را کنسل کنم؟',
        answer: 'شما هر زمان که بخواهید می توانید عضویت خودتان را لغو کنید. در اینصورت تنها حق عضویت دوره فعلی شما کسر خواهد شد(ماهیانه، سه ماهه یا شش ماه). برای این منظور کافی است در انتهای دوره عضویت اکانت خود را تمدید نکنید.',
        priority: 7,
        updated: '2020-12-07T11:09:46.371592+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 6,
        category: 'عمومی',
        title: '8-\tآیا تفاوتی بین پرداخت ماهانه و بالاتر از ماهانه وجود دارد؟',
        question: 'آیا تفاوتی بین پرداخت ماهانه و بالاتر از ماهانه وجود دارد؟',
        answer: 'بله طور حتم تفاوت وجود دارد. شما در صورت خرید حق عضویت بالاتر از یک ماه می توانید از تخفیف‌های لحاظ شده برخوردار شوید. به عنوان نمونه شما می توانید با پرداخت حدود 5 ماه حق عضویت به مدت 6 ماه از امکانات سهم تو بهره مند شوید و این یعنی نزدیک به 1 ماه استفاده رایگان!',
        priority: 8,
        updated: '2020-12-07T11:09:52.642510+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 5,
        category: 'عمومی',
        title: '9-\tآیا داده ها و تحلیل های سهم تو به روز و مورد اطمینان هستند؟',
        question: 'آیا داده‌ها و تحلیل‌های سهم تو به روز و مورد اطمینان هستند؟',
        answer: 'سهم تو در هر لحظه داده‌های منتشر شده در شبکه های اجتماعی را دریافت می کند و به فاصله کمی به صورت پردازش شده در صفحات کانال و صفحه هم سهام آخرین اطلاعات را نشان می دهد. بنابراین داده های مشاهده شده در سایت به صورت کاملا بر خط و مطمئن هستند.',
        priority: 9,
        updated: '2020-12-07T11:10:01.419351+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 4,
        category: 'عمومی',
        title: 'سهم تو چطور سیگنالهای موجود در شبکه های اجتماعی را پیدا می کند؟',
        question:
            'سهم تو چطور سیگنال‌های موجود در شبکه های اجتماعی را پیدا می‌کند؟',
        answer: 'سهم تو با استفاده از موتور جمع آوری اطلاعات و تحلیل گر هوشمند خود تمام اطلاعات منتشر شده در شبکه اجتماعی را جمع آوری و تحلیل می‌کند.',
        priority: 10,
        updated: '2020-12-07T11:10:11.408733+03:30',
        timestamp: '2020-11-01T17:05:46.384197+03:30',
    },
    {
        id: 14,
        category: 'عمومی',
        title: 'تازگی سیگنال به چه معناست؟',
        question: 'تازگی سیگنال به چه معناست؟',
        answer: 'سیگنال‌های مختلفی که برای هر سهم در کانال‌های تلگرامی ثبت می‌شوند، از نظر امتیاز با یکدیگر متفاوت هستند. هر چه سیگنال جدیدتر باشد امتیاز و اعتبار آن بالاتر است، به طوری که جدیدترین سیگنال امتیاز 100 و قدیمی ترین سیگنال امتیاز 0 را دریافت می‌کند. میانگین این امتیازها برای تمام سیگنال‌های یک سهم، به صورت امتیاز تازگی سیگنال آن سهم نمایش داده می‌شود که عددی بین 0 تا 100 است.',
        priority: 11,
        updated: '2020-12-07T11:10:22.685438+03:30',
        timestamp: '2020-11-08T14:10:52.895114+03:30',
    },
    {
        id: 15,
        category: 'عمومی',
        title: 'بازدهی ماهانه کانال چیست؟',
        question: 'بازدهی ماهانه کانال چیست؟',
        answer: 'هر کانال در طول یک ماه تعدادی سهم را سیگنال کرده است. میانگین بازدهی سهم‌های معرفی شده توسط کانال از زمان صدور سیگنال خرید تا زمان اعلام سیگنال فروش و یا حداکثر سی روز پس از اعلام سیگنال خرید، محاسبه شده و با عنوان بازدهی ماهانه کانال نمایش داده می‌شود.',
        priority: 12,
        updated: '2020-12-07T11:10:40.490402+03:30',
        timestamp: '2020-11-08T14:20:31.280740+03:30',
    },
    {
        id: 16,
        category: 'عمومی',
        title: 'رتبه اجتماعی کانال چیست؟',
        question: 'رتبه اجتماعی کانال چیست؟',
        answer: 'رتبه اجتماعی کانال‌ها، معیاری برای مقایسه تعداد اعضای آن‌ها با یکدیگر است. کانالی که بیشترین تعداد عضو را داشته باشد، رتبه اجتماعی 1 را دریافت می‌کند.',
        priority: 13,
        updated: '2020-12-07T11:10:44.355687+03:30',
        timestamp: '2020-11-08T14:30:15.685595+03:30',
    },
    {
        id: 17,
        category: 'عمومی',
        title: 'منظور از رتبه تحلیل‌گر چیست؟',
        question: 'منظور از رتبه تحلیل‌گر چیست؟',
        answer: 'سهم تو کانال‌های بورسی را بر اساس بازدهی ماهانه آن‌ها رتبه‌بندی می‌کند. هر چه بازدهی کانال بیشتر باشد، رتبه تحلیلگر بهتری را دریافت می‌کند. کانالی که بیشترین بازدهی ماهانه را داشته باشد، رتبه تحلیلگر آن 1 خواهد بود.',
        priority: 14,
        updated: '2020-12-07T11:10:49.078765+03:30',
        timestamp: '2020-11-08T14:35:21.754930+03:30',
    },
    {
        id: 18,
        category: 'عمومی',
        title: 'منظور از امتیاز ما به کانال چیست؟',
        question: 'منظور از امتیاز ما به کانال چیست؟',
        answer: 'امتیازی است که سهم تو از ترکیب رتبه اجتماعی کانال و رتبه تحلیلگر، به هر کانال اختصاص می‌دهد. در حقیقت امتیاز سهم تو بر اساس میزان بازدهی سیگنال‌ها و تعداد اعضای آن، به هر کانال داده می‌شود.',
        priority: 15,
        updated: '2020-12-07T11:10:54.476386+03:30',
        timestamp: '2020-11-08T15:08:33.047322+03:30',
    },
];

export default async function FaqPage({ params: { lang } }) {
    const dict = await getDictionary(lang);

    return (
        <main className="main">
            <div className="jumbotron">
                {!isMobile && <ProductsNavigator dict={dict} lang={lang} />}
                <div className="w-full">
                    <h1 className="mb-10 text-center text-3xl font-bold">
                        سوالات متداول
                    </h1>
                    <Accordion
                        type="single"
                        collapsible
                        className="mx-auto mb-10 w-full space-y-4"
                    >
                        {FAQs.map((faq, index) => (
                            <AccordionItem
                                key={faq.id}
                                className="rounded-md border"
                                value={faq.id.toString()}
                            >
                                <AccordionTrigger className="px-4 font-semibold [&[data-state=open]>svg]:rotate-180">
                                    {faq.title}
                                    <ChevronDown width={20} height={20} />
                                </AccordionTrigger>
                                <AccordionContent className="p-4 pt-0">
                                    <p>{faq.answer}</p>
                                </AccordionContent>
                            </AccordionItem>
                        ))}
                    </Accordion>
                    <Disclaimer />
                </div>
            </div>
        </main>
    );
}
