export const Descriptions = {
    NOT: {
        starter:
            'ارز دیجیتال نات کوین (NOTCOIN) را می‌توان پر سر و صداترین پروژه‌ی ارز دیجیتال چند سال اخیر دانست چرا که در کمتر از 6 ماه توانست 35 میلیون یوزر را جذب پروژه خود کند.',
        sections: [
            {
                title: 'معرفی پروژه نات کوین',
                text: 'ارز دیجیتال نات کوین (NOTCOIN) را می‌توان پر سر و صداترین پروژه‌ی ارز دیجیتال چند سال اخیر دانست چرا که در کمتر از 6 ماه توانست 35 میلیون یوزر را جذب پروژه خود کند. نات کوین به عنوان یک بازی کلیکی در اواسط نوامبر سال 2023 روی پلتفرم تلگرام ایجاد شد. این مینی اپ که در راستای اقدامات تلگرام برای تبدیل شدن به پلتفرمی برای پروژه‌های WEB3 ارائه شد، به کاربران اجازه می‌داد به ازای کلیک‌های پی در پی روی صفحه موبایل خود، توکن نات کوین را با نماد اختصاری NOT استخراج کنند. این پروژه تقریباً ۹ تریلیون ضربه (مشارکت کاربران) را ثبت کرده است که محبوبیت و مقبولیت آن در بین علاقه‌مندان به وب ۳ اشاره دارد.',
            },
            {
                title: 'نات کوین در صرافی‌های معتبر',
                text: 'ارز دیجیتال نات کوین در نهایت در 27 اردیبهشت ماه 1403 توانست مجوز لانچ شدن در اکثر صرافی‌های معتبر دنیا مانند: بایننس، کوکوین، بای بیت، اوکی اکس را کسب نماید و به طور رسمی به لیست رمزارزهای بزرگ دنیا بپیوندد. نات کوین در همان روز اول توانست به جمع 100 ارز دیجیتال برتر بازار راه پیدا کند و رمزارزهای میلیارد دلاری بپیوندد. استقبال بی نظیر از ارز دیجیتال نات کوین که از روشی خلاقانه برای ایردراپ خود استفاده کرد، باعث شد بازی‌های مشابه زیادی همچون همستر کامبت، تپ سوآپ، بلوم و... نیز از تلگرام برای جذب یوزر و پخش توکن خودشان بین یوزرها استفاده کنند.',
            },
            {
                title: 'قیمت نات کوین',
                text: 'ارز دیجیتال نات کوین در ابتدای لیست شدنش در صرافی‌های معتبر، در دقیقه‌های اول به قیمت 0.037 هم رسید ولی با فروکش کردن هیجانات معامله‌گران به قیمت تعادلی 0.012رسید. سوال امروز بسیاری از معامله گران و سرمایه گذاران بازار ارز دیجیتال این است که آیا مجددا قیمت نات کوین رشد می‌کند؟ برای پاسخ دادن به این سوال کافیست جمع‌بندی تحلیلگران برتر ارزهای دیجیتال را در سهمتو را مشاهده کنید که به شما نشان می‌دهد در ماه اخیر چه تعداد از تریدرها برای خرید یا فروش ناتکوین پیشنهادی ارائه کرده‌اند.',
            },
            {
                title: 'آیا نات کوین برای سرمایه‌گذاری مناسب است؟',
                text: 'نات کوین حامیان سرشناسی دارد، در یک پلفترم بسیار محبوب یعنی تلگرام عرضه شده است و کاربران زیادی با آن درگیر هستند. این عوامل، شرایط مناسبی را برای رشد نات کوین در آینده فراهم می‌کند. با این حال، در گذشته پروژه‌های قوی‌تری از نات کوین بوده‌اند که نتوانستند انتظارات سرمایه‌گذاران را براورده کنند و به طبع آن با شکست مواجه شدند. پس رشد قیمت نات کوین و ارزشمند شدن آن وابستگی زیادی به عملکرد تیم توسعه پروژه دارد.',
            },
            {
                title: 'آیا استخراج نات کوین Notcoin ادامه خواهد یافت؟',
                text: 'نات کوین در حال حاضر با یک سیستم پاداش دهی کاملا متفاوت، ایردراپ خود را از سرگرفته است. با توجه مصاحبه‌ای که قبلا ساشا پلوتوینوف داشته است، نات کوین هیچ توکن جدیدی اضافه نمی‌کند. ساشا در مصاحبه: خود به این نکته اشاره کرده است که: "ما می‌خواهیم این بازی را ادامه دهیم. کاری که ما می‌خواهیم انجام دهیم این است که اساساً استخرهایی برای کاربران فراهم کنیم تا بتوانند به استخراج یا فارمینگ از این استخرها در مدلی مشابه ادامه دهند، آنها فقط به کلیک کردن روی یک دکمه ادامه می‌دهند و سکه‌هایی با پیچیدگی بیشتر و پاداش‌های کمتری نسبت به آنچه وجود داشت به دست می‌آورند. " به‌بیان واضح‌تر، این مدل پاداش جدید به پروژه‌ها اجازه می‌دهد تا نات کوین‌ها را از بازار ثانویه خریداری کنند و سپس از آنها را برای تقویت پاداش‌های گیم‌پلی استفاده کنند.',
            },
        ],
    },
    PONKE: {
        starter:
            'ارز دیجیتال PONKE که با نام‌های پانک، پونکه یا پونکی در فارسی مطرح می‌شود یکی از جدیدترین میم‌کوین‌های اکوسیستم سولانا است که در دسامبر 2023 عرضه شده است.',
        sections: [
            {
                title: 'معرفی پروژه پونکی',
                text:
                    'ارز دیجیتال PONKE که با نام‌های پانک، پونکه یا پونکی در فارسی مطرح می‌شود یکی از جدیدترین میم‌کوین‌های اکوسیستم سولانا است که در دسامبر 2023 عرضه شده است. این ارز دیجیتال به دلیل سرعت بالای تراکنش‌ها و کارمزدهای کم مشهور است. در حال حاضر پونکی به عنوان یک دارایی دیجیتال نوآورانه شناخته می‌شود و به کاربران اجازه می‌دهد به راحتی تراکنش‌های خود را انجام دهند. این ارز دیجیتال تمرکز خود را بر ایجاد تجربه‌ای دوستانه‌تر و تعامل آسان‌تر برای کاربران قرار داده است. به همین دلیل پونکی در تلاش برای تشویق به تعامل جامعه و ایجاد فضایی است که در آن کاربران در فعالیت‌ها شرکت کنند، نظرات خود را به اشتراک بگذارند و در تصمیم‌گیری‌ها مشارکت داشته باشند. این امر از طریق رویدادهای جامعه‌محور، چالش‌ها و فعالیت‌های انگیزشی که به طور منظم برگزار می‌شود، تقویت می‌گردد. پونکی برا خلاف بسیاری از میم‌کوین‌ها که تمرکزشان بر سرگرمی است به دنبال راه اندازی جامعه فعال و کاربردی است اما با این حال، کاربردهای خیلی خاص و نقشه راه بلند پروازانه‌ای ندارد.\n' +
                    'مدل مدل توکنومیک این رمزارز به گونه‌ای است که در طولانی مدت ارزش بالایی برای دارندگان توکن ایجاد کند. \n',
            },
            {
                title: 'پونکی در صرافی‌های معتبر',
                text: 'این ارز دیجیتال که در حال حاضر با مارکت بالای 300 میلیون دلار جزو پروژه‌های با رتبه متوسط بازار قرار گرفته است در صرافی‌های ایرانی و خارجی متعددی لیست شده است. خرید این ارز دیجیتال از طریق تبدیل، کوینکس، ارزپلاس و کوینبیس مقدور است. ',
            },
            {
                title: 'قیمت پونکی',
                text: 'Ponke در حال حاضر در بین ارزاهای دیجیتال با ارزش بازار بیش از 300 میلیون دلار دارد و توانسته است سهم مناسبی از کل بازار را در اختیار بگیرد. تعداد کل تعداد واحدهای در گردش Ponke  برابر با ۵۵۵.5  میلیون واحد است واحد که تعداد کل واحدهای آن خواهد بود. پونکی از ابتدای لیست شدن خود تا به حال رشد مناسبی را تجربه کرده است. سوال امروز بسیاری از معامله گران و سرمایه گذاران بازار ارز دیجیتال این است که آیا مجددا قیمت کوین پونکی رشد می‌کند؟ برای پاسخ دادن به این سوال کافیست جمع‌بندی تحلیلگران برتر ارزهای دیجیتال را در سهمتو را مشاهده کنید که به شما نشان می‌دهد در ماه اخیر چه تعداد از تریدرها برای خرید یا فروش پونکی پیشنهادی ارائه کرده‌اند.',
            },
            {
                title: 'آیا پونکی برای سرمایه‌گذاری مناسب است؟',
                text: 'پونکی بر روی سولانا ارائه شده است و حامیان بزرگی نیز دارد. برخی پیش‌بینی‌ها از رشد بین 158% تا 267% این رمزارز تا پایان 2025 خبر می‌دهند که نشان‌دهنده افق مثبت پیش روی این ارزدیجیتال به زعم این افراد است. اما با توجه به نوسانات بالای این ارز پیشنهاد سرمایه‌گذاری فقط به کسانی می‌شود که طاقت ضررهای احتمالی و تحمل ریسک آن را داشته باشند.',
            },
        ],
    },
    PEPE: {
        starter:
            'پروژه پپه (PEPE) یکی از میم‌کوین‌های مبتنی بر شبکه اتریوم است که در سال 2023 راه‌اندازی شده است.',
        sections: [
            {
                title: 'معرفی پروژه پپه ',
                text: 'پروژه پپه (PEPE) یکی از میم‌کوین‌های مبتنی بر شبکه اتریوم است که در سال 2023 راه‌اندازی شده است. ارز دیجیتال پپه همانند بسیاری دیگر از میم‌کوین‌ها ارزش ذاتی یا کاربرد خاصی ندارد و صرفاً برای سرگرمی و به عنوان یک میم‌کوین طراحی شده است. شخصیت “Pepe the Frog” که نقش مهمی هم در موفقیت پروژه پپه (PEPE) ایفا کرده است، بر گرفته از شخصیتی است که مت فیوری در سال 2005 آن را خلق کرده است و یکی از نمادهای محبوب اینترنتی است. اما این نماد هیچ ارتباطی با مت فیوری ندارد و سازندگان این میم کوین ناشناس هستند.',
            },
            {
                title: 'آیا ارز دیجیتال پپه ارزش دارد؟',
                text: 'برخی از ارزهای دیجیتال برای کاربرد مشخصی ایجاد می‌شوند و به واسطه آن ارزش افزوده‌ای که ایجاد می‌کنند، ارزش کوین نیز رشد پیدا می‌کند. اما ارز دیجیتال پپه (PEPE)  جزو این دسته محسوب نمی‌شود چرا که در وب سایت رسمی ارز دیجیتال پپه به این موضوع که پپه هیچ ارزش ذاتی ندارد اشاره شده است. با این وجود ارز دیجیتال پپه در صرافی‌های معتبر دنیا نظیر بایننس، کوکوین و... لیست شد و توانست به سرعت جزو 100 کوین برتر بازار شود. ',
            },
            {
                title: 'قیمت پپه (PEPE)',
                text: 'پپه در بعد از سه روز از لیست شدنس با رشد عجیبی و غریبی رو به رو شد و یک صفر از قیمت آن کم شد. سپس بعد از اصلاح جزیی در دو روز توانست 214 درصد صعود کند. پپه همچنان به رشد قیمتی خود ادامه می‌دهد و سرمایه‌گذاران ارزدیجیتال پپه را جزو برترین میم کوین‌ها برای سرمایه‌گذاری می‌دانند و امید دارند که پپه در ادامه نیز رشد زیادی کند. ',
            },
            {
                title: 'آیا ارز دیجیتال پپه (PEPE) برای سرمایه‌گذاری مناسب است؟',
                text: 'با اینکه پروژه‌ی پپه همانطور در سایتش گفته شده کاربرد خاصی ندارد ولی به علت توکن سوزی مداومی که انجام می‌دهد با رشد خوبی مواجه شده است. پیش‌بینی های مختلفی در مورد آینده قیمتی پپه در دو ماه اخیر ارائه شده است که از از 0.0000077223 تا 0.000026336 متغیر است. اما به نظر می‌آید پپه بعد از اصلاح قیمتی که داشته است به سمت اهداف بالاتری حرکت کند. ',
            },
        ],
    },
    FLOKI: {
        starter:
            'ارز دیجیتال فلوکی (Floki) جزو میم کوین های محبوب بازار کریپتوکارنسی شناخته می‌شود. اغلب میم کوین های کاربرد خاصی ندارند و صرفا روی علاقه کاربران به دنیای میم کوین ها حساب باز می کنند. ',
        sections: [
            {
                title: 'معرفی پروژه فلوکی اینو',
                text: 'ارز دیجیتال فلوکی (Floki) جزو میم کوین های محبوب بازار کریپتوکارنسی شناخته می‌شود. اغلب میم کوین های کاربرد خاصی ندارند و صرفا روی علاقه کاربران به دنیای میم کوین ها حساب باز می کنند. اما داستان شکل گیری فلوکی اینو بسیار جذاب است. ایلان ماسک سگی را به سرپرستی گرفت و اسم آن فلوکی گذاشت. بعد از این ماجرا، تیم توسعه فلوکی با الهام گرفتن از توییت ایران ماسک، نام پروژه خود را فلوکی گذاشتند.اما با گذشت زمان فلوکی تکامل پیدا کرد و به یک اکوسیستم تبدیل شد. در حال حاضر نیز روی کمک خیرخواهانه در کشور توسعه نیافته تمرکز کرده است.',
            },
            {
                title: 'فلوکی در صرافی‌های معتبر',
                text: 'فلوکی به سرعت توانست در بین علاقه مندان کریپتوکارنسی به محبوبیت برسد. به همین دلیل اغلب صرافی های معتبر جهان شروع به لیست کردن فلوکی اینو در صرافی‌های خود کردند. در حال حاضر امکان خرید و فروش فلوکی در اغلب صرافی‌های معتبر جهان مانند بایننس، کوکوین، اوکی اکس، بای بیت و ... وجود دارد.',
            },
            {
                title: 'قیمت فلوکی',
                text: 'این ارز دیجیتال در سال 2021 با قیمت 0.0000042 دلار عرضه شد و در نوامبر همان سال قیمت 0.00031 دلار را تجربه کرد. پس از این صعود ناگهانی این رمزارز به‌تدریج سقوط کرد و به محدوده‌ی قیمت اولیه‌اش برگشت. قیمت فلوکی اینو ممکن است با شروع آلت سیزن 2024 رشد عجیبی را تجربه کند و به قیمت‌هایی عجیب و غریب برسد.',
            },
            {
                title: 'آیا فلوکی برای سرمایه گذاری مناسب است؟',
                text:
                    'رمزارز فلوکی ممکن است برای سرمایه‌گذاران ریسک‌پذیر جذاب باشد، اما برای کسانی که به دنبال سرمایه‌گذاری باثبات‌تر هستند، گزینه مناسبی نیست. بر خلاف رمزارزهای مطرحی همانند بیت کوین، سولانا و... قیمت فلوکی اینو به دلیل نوسانات زیاد و تأثیرپذیری از احساسات بازار و رفتار سرمایه‌گذاران، مستعد تغییرات سریع و قابل توجهی است. به عنوان مثال تاثیر قیمت این میم‌کوین از توئئیت‌های ایلان ماسک به طور قابل توجهی بالا است. هرچند ایلان ماسک به صراحت این ارز دیجیتال را تأیید نکرده است، اما حمایت‌های غیرمستقیم او تا به حالم نجر به افزایش قیمت فلوکی شده است.\n' +
                    'اگر چه برخی از سرمایه‌گذاران آینده روشنی را برای فلوکی متصور هستند اما معتقدند با وجود تلاش‌های تیم توسعه‌دهنده برای گسترش کاربردهای فلوکی اینو، این ارزدیجیتال هنوز به اندازه کافی کاربردی نیست. همچنین سرمایه‌گذاری در فلوکی اینو را به دلیل ماهیت میم کوین‌ها و احتمال پامپ و دامپ (افزایش و کاهش ناگهانی قیمت) بسیار پرریسک می‌دانند.\n',
            },
        ],
    },
    SHIB: {
        starter:
            'اغلب فعالان بازار ارز دیجیتال شیبا اینو (Shiba inu) را به عنوان قاتل دوج کوین می‌شناسند. شیبا اینو یکی از معروف ترین میم کوین‌های بازار ارزدیجیتال است که بعد از دوج کوین به روی کار آمد.',
        sections: [
            {
                title: 'معرفی شیبا اینو',
                text:
                    'اغلب فعالان بازار ارز دیجیتال شیبا اینو (Shiba inu) را به عنوان قاتل دوج کوین می‌شناسند. شیبا اینو یکی از معروف ترین میم کوین‌های بازار ارزدیجیتال است که بعد از دوج کوین به روی کار آمد. در سال 2020 که شیبا اینو در بازار ارز دیجیتال عرضه شد کمتر کسی به این فکر می‌کرد که شیبا اینو بتواند جای دوج کوین را بگیرد. اما شیبا با محبوبیتی که برای خود دست و پا کرد، رشد قیمتی عجیبی را تجربه کرد به طوری که  از قیمت ۰.۰۰۰۰۰۰۰۰۰۰۵۶ به 0.00008 رسید.  رشد عجیب و غریب شیبا اینو باعث شد تمام پروژه‌های بعد از شیبا به عنوان یک شیبا اینو جدید معرفی گردد. هیچکدام از پروژه‌های بعد از شیبا نتوانستند رشد عجیب و غریب این میم کوین محبوب را تجربه کنند. \n' +
                    'هدف ایجاد شیبا اینو  با نماد SHIB در کنار ماهیت میم یا شوخی‌بودن آن، بررسی رفتار سرمایه‌گذاران با ارز دیجیتالی بود که بدون تبلیغ یا پشتوانه‌ مالی در این جامعه‌ غیر‌متمرکز معرفی می‌شود. توکن شیبا اینو با نماد SHIB، بلاک چین اختصاصی نداشته و به‌سادگی یک توکن با استاندارد ERC20 روی پلتفرم اتریوم است.\n',
            },
            {
                title: 'قیمت شیبا اینو',
                text: 'سقف تاریخی ارز دیجیتال شیبا اینو (SHIB) متعلق به 6 آبان ماه 1400 است که موفق شد سقف 0.000088 را ثبت کند.   اما با شروع ریزش تاریخی ارزهای دیجیتال قیمت این ارز دیجیتال محبوب بازار به 0.00000822  رسید. با توجه به اینکه شیبا اینو معمولا نوسان قیمتی  شدیدی را تجربه می‌کند، به سرمایه‌گذاران تازه وارد توصیه می‌شود که روی این میم کوین سرمایه‌گذاری نکنند.',
            },
            {
                title: 'آیا شیبا اینو برای سرمایه‌گذاری مناسب است ؟',
                text: 'شیبا اینو با توجه به محبوبیتی که در بازار دارد، پتانسیل رشد بالایی را از خود نشان داده است. میم کوین‌های زیادی در بازار وجود دارند ولی به جرات می‌توان گفت هیچکدام از آن‌ها، محبوبیت شیبا اینو را ندارند. موارد استفاده شیبا در جهان روزبه‌روز در حال افزایش است. تمام این موارد می‌تواند نشانه‌ای از رشد این توکن در آینده نزدیک باشد. آینده‌ای که بدون شک از آن ارزهای دیجیتال خواهد بود.  اما  توصیه ما به کسانی که تازه به بازار ارز دیجیتال وارد شدند، این است که روی میم کوین‌ها و یا کلا کوین‌هایی که نوسان قیمتی شدیدی دارند سرمایه‌گذاری نکنند چرا که ریسک این کوین‌ها بسیار بالاست.',
            },
        ],
    },
};
