import { cn } from '@/libs/utils';

export function Disclaimer({ className }: { className?: string }) {
    return (
        <div
            className={cn(
                'w-full rounded-lg border border-neutral-100 bg-white p-5',
                className
            )}
        >
            <h6 className="text-xl font-black">سلب مسئولیت</h6>
            <p className="mt-2 text-justify text-base">
                هر محتوا و مطالب مندرج در سایت و کانال‌های رسمی ارتباطی سهمتو،
                جمع‌بندی نظرات و تحلیل‌های شخصی و غیر تعهد آور بوده و هیچگونه
                توصیه‌ای مبنی بر خرید، فروش، ورود و یا خروج از بازار بورس و ارز
                دیجیتال نمی باشد. همچنین کلیه اخبار و تحلیل‌های مندرج در سایت و
                کانال‌ها، صرفا بازنشر اطلاعات از منابع رسمی و غیر رسمی داخلی و
                خارجی است و بدیهی است استفاده کنندگان محتوای مذکور، مسئول پیگیری
                و حصول اطمینان از اصالت و درستی مطالب هستند. از این رو ضمن سلب
                مسئولیت اعلام می‌دارد مسئولیت هرنوع تصمیم گیری و اقدام و سود و
                زیان احتمالی در بازار سرمایه و ارز دیجیتال، با شخص معامله گر
                است.
            </p>
        </div>
    );
}
